[Killed] Block
testsProf/Tp_Node/src/book.repository.js:17:21
     /**
      * Nombre total de livre
      */
-    getTotalCount() {
-        return this.db.get('books').size().value();
-    }
+    getTotalCount() {}
 
     /**

[Killed] Block
testsProf/Tp_Node/src/book.repository.js:24:21
     /**
      * Somme du prix de tous les livre
      */
-    getTotalPrice() {
-        let totalPrice = 0;
-        this.db.get('books').value().forEach(book => {
-            totalPrice += book.price;
-        });
-        return totalPrice;
-    }
+    getTotalPrice() {}
 
 

[Killed] Block
testsProf/Tp_Node/src/book.repository.js:26:54
      */
     getTotalPrice() {
         let totalPrice = 0;
-        this.db.get('books').value().forEach(book => {
-            totalPrice += book.price;
-        });
+        this.db.get('books').value().forEach(book => {});
         return totalPrice;
     }

[Survived] StringLiteral
testsProf/Tp_Node/src/book.repository.js:26:21
      */
     getTotalPrice() {
         let totalPrice = 0;
-        this.db.get('books').value().forEach(book => {
+        this.db.get("").value().forEach(book => {
             totalPrice += book.price;
         });

[Killed] Block
testsProf/Tp_Node/src/book.repository.js:36:29
     /**
      * Retourne un livre
      */
-    getBookByName(bookName) {
-        return this.db.get('books').find({name: bookName}).value();
-    }
+    getBookByName(bookName) {}
 
     /**

[Survived] StringLiteral
testsProf/Tp_Node/src/book.repository.js:60:35
      *  ]
      */
     getCountBookAddedByMonth(bookName) {
-        const books = this.db.get('books').filter({name: bookName}).value();
+        const books = this.db.get("").filter({name: bookName}).value();
         if (books.length === 0) {
             throw 'Book is not present in the database';

[Killed] Block
testsProf/Tp_Node/src/book.repository.js:61:33
      */
     getCountBookAddedByMonth(bookName) {
         const books = this.db.get('books').filter({name: bookName}).value();
-        if (books.length === 0) {
-            throw 'Book is not present in the database';
-        }
+        if (books.length === 0) {}
 
         const results = [];

[Killed] IfStatement
testsProf/Tp_Node/src/book.repository.js:61:13
      */
     getCountBookAddedByMonth(bookName) {
         const books = this.db.get('books').filter({name: bookName}).value();
-        if (books.length === 0) {
+        if (false) {
             throw 'Book is not present in the database';
         }

[Killed] Block
testsProf/Tp_Node/src/book.repository.js:71:31
         let count = 0;
         let count_cumulative = 0;
 
-        books.forEach(book => {
-            count = 0;
-            year = new Date(book.added_at).getFullYear();
-            month = new Date(book.added_at).getMonth()+1;
-            count = books.filter(book =>
-                new Date(book.added_at).getFullYear() === year
-                &&
-                new Date(book.added_at).getMonth()+1 === month
-            ).length;
-
-            if (results.filter(result => result.year === year && result.month === month).length === 0) {
-                count_cumulative += count;
-                results.push({year, month, count, count_cumulative});
-            }
-        });
+        books.forEach(book => {});
         return results;
     }

[Killed] BinaryExpression
testsProf/Tp_Node/src/book.repository.js:74:21
         books.forEach(book => {
             count = 0;
             year = new Date(book.added_at).getFullYear();
-            month = new Date(book.added_at).getMonth()+1;
+            month = new Date(book.added_at).getMonth() - 1;
             count = books.filter(book =>
                 new Date(book.added_at).getFullYear() === year

[Killed] ConditionalExpression
testsProf/Tp_Node/src/book.repository.js:76:17
             year = new Date(book.added_at).getFullYear();
             month = new Date(book.added_at).getMonth()+1;
             count = books.filter(book =>
-                new Date(book.added_at).getFullYear() === year
-                &&
-                new Date(book.added_at).getMonth()+1 === month
+                true
             ).length;
 

[Killed] BinaryExpression
testsProf/Tp_Node/src/book.repository.js:76:17
             year = new Date(book.added_at).getFullYear();
             month = new Date(book.added_at).getMonth()+1;
             count = books.filter(book =>
-                new Date(book.added_at).getFullYear() === year
-                &&
-                new Date(book.added_at).getMonth()+1 === month
+                new Date(book.added_at).getFullYear() === year || new Date(book.added_at).getMonth() + 1 === month
             ).length;
 

[Killed] BinaryExpression
testsProf/Tp_Node/src/book.repository.js:78:17
             count = books.filter(book =>
                 new Date(book.added_at).getFullYear() === year
                 &&
-                new Date(book.added_at).getMonth()+1 === month
+                new Date(book.added_at).getMonth() + 1 !== month
             ).length;
 

[Killed] ConditionalExpression
testsProf/Tp_Node/src/book.repository.js:78:17
             count = books.filter(book =>
                 new Date(book.added_at).getFullYear() === year
                 &&
-                new Date(book.added_at).getMonth()+1 === month
+                false
             ).length;
 

[Killed] BinaryExpression
testsProf/Tp_Node/src/book.repository.js:81:66
                 new Date(book.added_at).getMonth()+1 === month
             ).length;
 
-            if (results.filter(result => result.year === year && result.month === month).length === 0) {
+            if (results.filter(result => result.year === year && result.month !== month).length === 0) {
                 count_cumulative += count;
                 results.push({year, month, count, count_cumulative});

[Killed] BinaryExpression
testsProf/Tp_Node/src/book.repository.js:81:42
                 new Date(book.added_at).getMonth()+1 === month
             ).length;
 
-            if (results.filter(result => result.year === year && result.month === month).length === 0) {
+            if (results.filter(result => result.year === year || result.month === month).length === 0) {
                 count_cumulative += count;
                 results.push({year, month, count, count_cumulative});
