[Survived] StringLiteral
testsProf/Tp_Node/src/db.js:1:19
-var low = require('lowdb');
+var low = require("");
 var FileSync = require('lowdb/adapters/FileSync');
 

[Survived] StringLiteral
testsProf/Tp_Node/src/db.js:2:24
 var low = require('lowdb');
-var FileSync = require('lowdb/adapters/FileSync');
+var FileSync = require("");
 
 var adapter = new FileSync('db.json');

[Survived] ObjectLiteral
testsProf/Tp_Node/src/db.js:8:13
 var db = low(adapter);
 
 // Set some defaults
-db.defaults({ books: []})
+db.defaults({})
     .write();
 
