[Survived] BinaryExpression
testsProf/Tp_Node/src/interval.js:8:16
     }
 
     toString() {
-        return "[" + this.start + "," + this.end + "]";
+        return "[" + this.start - "," + this.end + "]";
     }
 

[Killed] BinaryExpression
testsProf/Tp_Node/src/interval.js:26:45
      * @returns {boolean}
      */
     overlaps(interval) {
-        return this.end > interval.start && this.start < interval.end;
+        return this.end > interval.start && this.start >= interval.end;
     }
 

[Killed] Block
testsProf/Tp_Node/src/interval.js:45:24
      * @param {Interval} interval
      * @returns {boolean}
      */
-    includes(interval) {
-        return (interval.start>= this.start && interval.end<= this.end);
-    };
+    includes(interval) {};
 
     /**

[Killed] ConditionalExpression
testsProf/Tp_Node/src/interval.js:46:17
      * @returns {boolean}
      */
     includes(interval) {
-        return (interval.start>= this.start && interval.end<= this.end);
+        return (false);
     };
 

[Killed] ConditionalExpression
testsProf/Tp_Node/src/interval.js:46:17
      * @returns {boolean}
      */
     includes(interval) {
-        return (interval.start>= this.start && interval.end<= this.end);
+        return (false && interval.end<= this.end);
     };
 

[Killed] IfStatement
testsProf/Tp_Node/src/interval.js:69:12
         let newStart = this.start;
         let newEnd = this.end;
         
-        if(this.end < interval.start ){
+        if(true ){
             return [this, interval];
         }else if( interval.end < this.start){

[Killed] IfStatement
testsProf/Tp_Node/src/interval.js:69:12
         let newStart = this.start;
         let newEnd = this.end;
         
-        if(this.end < interval.start ){
+        if(false ){
             return [this, interval];
         }else if( interval.end < this.start){

[Killed] BinaryExpression
testsProf/Tp_Node/src/interval.js:71:19
         
         if(this.end < interval.start ){
             return [this, interval];
-        }else if( interval.end < this.start){
+        }else if( interval.end <= this.start){
             return[interval,this];
         } 	

[Killed] BinaryExpression
testsProf/Tp_Node/src/interval.js:71:19
         
         if(this.end < interval.start ){
             return [this, interval];
-        }else if( interval.end < this.start){
+        }else if( interval.end >= this.start){
             return[interval,this];
         } 	

[Killed] ArrayLiteral
testsProf/Tp_Node/src/interval.js:72:19
         if(this.end < interval.start ){
             return [this, interval];
         }else if( interval.end < this.start){
-            return[interval,this];
+            return[];
         } 	
                 

[Killed] BinaryExpression
testsProf/Tp_Node/src/interval.js:75:12
             return[interval,this];
         } 	
                 
-        if(interval.start> this.start){
+        if(interval.start <= this.start){
             newStart= this.start;
         }

[Killed] IfStatement
testsProf/Tp_Node/src/interval.js:75:12
             return[interval,this];
         } 	
                 
-        if(interval.start> this.start){
+        if(false){
             newStart= this.start;
         }

[Killed] Block
testsProf/Tp_Node/src/interval.js:78:14
         if(interval.start> this.start){
             newStart= this.start;
         }
-        else {
-            newStart= interval.start;
-        }
+        else {}
         
         if(interval.end< this.end) {

[Killed] IfStatement
testsProf/Tp_Node/src/interval.js:82:12
             newStart= interval.start;
         }
         
-        if(interval.end< this.end) {
+        if(false) {
             newEnd= this.end;
         }

[Killed] BinaryExpression
testsProf/Tp_Node/src/interval.js:82:12
             newStart= interval.start;
         }
         
-        if(interval.end< this.end) {
+        if(interval.end >= this.end) {
             newEnd= this.end;
         }

[Survived] Block
testsProf/Tp_Node/src/interval.js:85:13
         if(interval.end< this.end) {
             newEnd= this.end;
         }
-        else{
-            newEnd= interval.end;
-        }
+        else{}
         
         return new Interval(newStart,newEnd);

[Killed] Block
testsProf/Tp_Node/src/interval.js:108:28
      * @param {Interval} interval
      * @returns {Interval|null}
      */
-    intersection(interval) {
-        let newStart = null;
-        let newEnd = null;	
-        if(this.end > interval.start && this.start < interval. start){
-            newStart = interval.start;
-            for (let i= newStart; i<=this.end; i++){
-                if(i > interval.end){ break;}
-                newEnd = i;
-            }
-        }else if (interval.end > this.start && interval.start < this.start){
-            newStart = this.start;
-            for(let j=0 ; j<= interval.end; j++){
-                if(j>this.end) break;
-                newEnd = j ;
-            }
-        }
-        if(newStart == null) return null;
-        return new Interval(newStart,newEnd);
-    };
+    intersection(interval) {};
 
     /**

[Killed] BinaryExpression
testsProf/Tp_Node/src/interval.js:111:41
     intersection(interval) {
         let newStart = null;
         let newEnd = null;	
-        if(this.end > interval.start && this.start < interval. start){
+        if(this.end > interval.start && this.start >= interval.start){
             newStart = interval.start;
             for (let i= newStart; i<=this.end; i++){

[Killed] BinaryExpression
testsProf/Tp_Node/src/interval.js:111:12
     intersection(interval) {
         let newStart = null;
         let newEnd = null;	
-        if(this.end > interval.start && this.start < interval. start){
+        if(this.end <= interval.start && this.start < interval. start){
             newStart = interval.start;
             for (let i= newStart; i<=this.end; i++){

[Killed] ForStatement
testsProf/Tp_Node/src/interval.js:113:35
         let newEnd = null;	
         if(this.end > interval.start && this.start < interval. start){
             newStart = interval.start;
-            for (let i= newStart; i<=this.end; i++){
+            for (let i= newStart; false; i++){
                 if(i > interval.end){ break;}
                 newEnd = i;

[Killed] BinaryExpression
testsProf/Tp_Node/src/interval.js:113:35
         let newEnd = null;	
         if(this.end > interval.start && this.start < interval. start){
             newStart = interval.start;
-            for (let i= newStart; i<=this.end; i++){
+            for (let i= newStart; i > this.end; i++){
                 if(i > interval.end){ break;}
                 newEnd = i;

[Killed] IfStatement
testsProf/Tp_Node/src/interval.js:114:20
         if(this.end > interval.start && this.start < interval. start){
             newStart = interval.start;
             for (let i= newStart; i<=this.end; i++){
-                if(i > interval.end){ break;}
+                if(false){ break;}
                 newEnd = i;
             }

[Killed] BinaryExpression
testsProf/Tp_Node/src/interval.js:114:20
         if(this.end > interval.start && this.start < interval. start){
             newStart = interval.start;
             for (let i= newStart; i<=this.end; i++){
-                if(i > interval.end){ break;}
+                if(i >= interval.end){ break;}
                 newEnd = i;
             }

[Killed] BinaryExpression
testsProf/Tp_Node/src/interval.js:117:48
                 if(i > interval.end){ break;}
                 newEnd = i;
             }
-        }else if (interval.end > this.start && interval.start < this.start){
+        }else if (interval.end > this.start && interval.start >= this.start){
             newStart = this.start;
             for(let j=0 ; j<= interval.end; j++){

[Killed] IfStatement
testsProf/Tp_Node/src/interval.js:117:19
                 if(i > interval.end){ break;}
                 newEnd = i;
             }
-        }else if (interval.end > this.start && interval.start < this.start){
+        }else if (false){
             newStart = this.start;
             for(let j=0 ; j<= interval.end; j++){

[Killed] BinaryExpression
testsProf/Tp_Node/src/interval.js:119:27
             }
         }else if (interval.end > this.start && interval.start < this.start){
             newStart = this.start;
-            for(let j=0 ; j<= interval.end; j++){
+            for(let j=0 ; j > interval.end; j++){
                 if(j>this.end) break;
                 newEnd = j ;

[Killed] Block
testsProf/Tp_Node/src/interval.js:119:49
             }
         }else if (interval.end > this.start && interval.start < this.start){
             newStart = this.start;
-            for(let j=0 ; j<= interval.end; j++){
-                if(j>this.end) break;
-                newEnd = j ;
-            }
+            for(let j=0 ; j<= interval.end; j++){}
         }
         if(newStart == null) return null;

[Killed] BinaryExpression
testsProf/Tp_Node/src/interval.js:120:20
         }else if (interval.end > this.start && interval.start < this.start){
             newStart = this.start;
             for(let j=0 ; j<= interval.end; j++){
-                if(j>this.end) break;
+                if(j <= this.end) break;
                 newEnd = j ;
             }

[Killed] IfStatement
testsProf/Tp_Node/src/interval.js:120:20
         }else if (interval.end > this.start && interval.start < this.start){
             newStart = this.start;
             for(let j=0 ; j<= interval.end; j++){
-                if(j>this.end) break;
+                if(true) break;
                 newEnd = j ;
             }

[Killed] BinaryExpression
testsProf/Tp_Node/src/interval.js:124:12
                 newEnd = j ;
             }
         }
-        if(newStart == null) return null;
+        if(newStart != null) return null;
         return new Interval(newStart,newEnd);
     };

[Killed] IfStatement
testsProf/Tp_Node/src/interval.js:124:12
                 newEnd = j ;
             }
         }
-        if(newStart == null) return null;
+        if(false) return null;
         return new Interval(newStart,newEnd);
     };

[Killed] Block
testsProf/Tp_Node/src/interval.js:144:25
      * @param {Interval} interval
      * @returns {Interval[]}
      */
-    exclusion(interval) {
-        if (this.start == interval.start && this.end == interval.end) return null;
-        if(this.overlaps(interval)){
-            let intersection = this.intersection(interval);
-            if((this.end>interval.start && interval.start>this.start) && interval.end> this.end){
-                return [new Interval(this.start,intersection.start),new Interval(intersection.end,interval.end)];
-            }else if((interval.end> this.start && this.start> interval.start) && this.end> interval.end){
-                return [new Interval(interval.start,intersection.start),new Interval(intersection.end,this.end)];
-            }else if((this.end>interval.start && interval.start>this.start) && interval.end< this.end){
-                return [new Interval(this.start,intersection.start),new Interval(intersection.end,this.end)]
-            }else if ((interval.end> this.start && this.start> interval.start) && this.end < interval.end){
-                return [new Interval(interval.start,intersection.start),new Interval(intersection.end,interval.end)];
-            }
-        }else{
-            if(this.start < interval.start){
-                return [this,interval];
-            }else{
-                return [interval,this];
-            }
-        }
-    };
+    exclusion(interval) {};
 }
 

[Killed] IfStatement
testsProf/Tp_Node/src/interval.js:145:13
      * @returns {Interval[]}
      */
     exclusion(interval) {
-        if (this.start == interval.start && this.end == interval.end) return null;
+        if (false) return null;
         if(this.overlaps(interval)){
             let intersection = this.intersection(interval);

[Killed] ConditionalExpression
testsProf/Tp_Node/src/interval.js:145:13
      * @returns {Interval[]}
      */
     exclusion(interval) {
-        if (this.start == interval.start && this.end == interval.end) return null;
+        if (false && this.end == interval.end) return null;
         if(this.overlaps(interval)){
             let intersection = this.intersection(interval);

[Killed] IfStatement
testsProf/Tp_Node/src/interval.js:146:12
      */
     exclusion(interval) {
         if (this.start == interval.start && this.end == interval.end) return null;
-        if(this.overlaps(interval)){
+        if(true){
             let intersection = this.intersection(interval);
             if((this.end>interval.start && interval.start>this.start) && interval.end> this.end){

[Killed] IfStatement
testsProf/Tp_Node/src/interval.js:146:12
      */
     exclusion(interval) {
         if (this.start == interval.start && this.end == interval.end) return null;
-        if(this.overlaps(interval)){
+        if(false){
             let intersection = this.intersection(interval);
             if((this.end>interval.start && interval.start>this.start) && interval.end> this.end){

[Killed] IfStatement
testsProf/Tp_Node/src/interval.js:148:16
         if (this.start == interval.start && this.end == interval.end) return null;
         if(this.overlaps(interval)){
             let intersection = this.intersection(interval);
-            if((this.end>interval.start && interval.start>this.start) && interval.end> this.end){
+            if(false){
                 return [new Interval(this.start,intersection.start),new Interval(intersection.end,interval.end)];
             }else if((interval.end> this.start && this.start> interval.start) && this.end> interval.end){

[Killed] IfStatement
testsProf/Tp_Node/src/interval.js:148:16
         if (this.start == interval.start && this.end == interval.end) return null;
         if(this.overlaps(interval)){
             let intersection = this.intersection(interval);
-            if((this.end>interval.start && interval.start>this.start) && interval.end> this.end){
+            if(true){
                 return [new Interval(this.start,intersection.start),new Interval(intersection.end,interval.end)];
             }else if((interval.end> this.start && this.start> interval.start) && this.end> interval.end){

[Killed] ArrayLiteral
testsProf/Tp_Node/src/interval.js:149:24
         if(this.overlaps(interval)){
             let intersection = this.intersection(interval);
             if((this.end>interval.start && interval.start>this.start) && interval.end> this.end){
-                return [new Interval(this.start,intersection.start),new Interval(intersection.end,interval.end)];
+                return [];
             }else if((interval.end> this.start && this.start> interval.start) && this.end> interval.end){
                 return [new Interval(interval.start,intersection.start),new Interval(intersection.end,this.end)];

[Killed] ConditionalExpression
testsProf/Tp_Node/src/interval.js:150:82
             let intersection = this.intersection(interval);
             if((this.end>interval.start && interval.start>this.start) && interval.end> this.end){
                 return [new Interval(this.start,intersection.start),new Interval(intersection.end,interval.end)];
-            }else if((interval.end> this.start && this.start> interval.start) && this.end> interval.end){
+            }else if((interval.end> this.start && this.start> interval.start) && true){
                 return [new Interval(interval.start,intersection.start),new Interval(intersection.end,this.end)];
             }else if((this.end>interval.start && interval.start>this.start) && interval.end< this.end){

[Killed] BinaryExpression
testsProf/Tp_Node/src/interval.js:150:23
             let intersection = this.intersection(interval);
             if((this.end>interval.start && interval.start>this.start) && interval.end> this.end){
                 return [new Interval(this.start,intersection.start),new Interval(intersection.end,interval.end)];
-            }else if((interval.end> this.start && this.start> interval.start) && this.end> interval.end){
+            }else if((interval.end <= this.start && this.start> interval.start) && this.end> interval.end){
                 return [new Interval(interval.start,intersection.start),new Interval(intersection.end,this.end)];
             }else if((this.end>interval.start && interval.start>this.start) && interval.end< this.end){

[Killed] ArrayLiteral
testsProf/Tp_Node/src/interval.js:151:24
             if((this.end>interval.start && interval.start>this.start) && interval.end> this.end){
                 return [new Interval(this.start,intersection.start),new Interval(intersection.end,interval.end)];
             }else if((interval.end> this.start && this.start> interval.start) && this.end> interval.end){
-                return [new Interval(interval.start,intersection.start),new Interval(intersection.end,this.end)];
+                return [];
             }else if((this.end>interval.start && interval.start>this.start) && interval.end< this.end){
                 return [new Interval(this.start,intersection.start),new Interval(intersection.end,this.end)]

[Killed] ConditionalExpression
testsProf/Tp_Node/src/interval.js:152:80
                 return [new Interval(this.start,intersection.start),new Interval(intersection.end,interval.end)];
             }else if((interval.end> this.start && this.start> interval.start) && this.end> interval.end){
                 return [new Interval(interval.start,intersection.start),new Interval(intersection.end,this.end)];
-            }else if((this.end>interval.start && interval.start>this.start) && interval.end< this.end){
+            }else if((this.end>interval.start && interval.start>this.start) && false){
                 return [new Interval(this.start,intersection.start),new Interval(intersection.end,this.end)]
             }else if ((interval.end> this.start && this.start> interval.start) && this.end < interval.end){

[Killed] IfStatement
testsProf/Tp_Node/src/interval.js:152:22
                 return [new Interval(this.start,intersection.start),new Interval(intersection.end,interval.end)];
             }else if((interval.end> this.start && this.start> interval.start) && this.end> interval.end){
                 return [new Interval(interval.start,intersection.start),new Interval(intersection.end,this.end)];
-            }else if((this.end>interval.start && interval.start>this.start) && interval.end< this.end){
+            }else if(true){
                 return [new Interval(this.start,intersection.start),new Interval(intersection.end,this.end)]
             }else if ((interval.end> this.start && this.start> interval.start) && this.end < interval.end){

[Killed] BinaryExpression
testsProf/Tp_Node/src/interval.js:154:83
                 return [new Interval(interval.start,intersection.start),new Interval(intersection.end,this.end)];
             }else if((this.end>interval.start && interval.start>this.start) && interval.end< this.end){
                 return [new Interval(this.start,intersection.start),new Interval(intersection.end,this.end)]
-            }else if ((interval.end> this.start && this.start> interval.start) && this.end < interval.end){
+            }else if ((interval.end> this.start && this.start> interval.start) && this.end >= interval.end){
                 return [new Interval(interval.start,intersection.start),new Interval(intersection.end,interval.end)];
             }

[Killed] BinaryExpression
testsProf/Tp_Node/src/interval.js:154:24
                 return [new Interval(interval.start,intersection.start),new Interval(intersection.end,this.end)];
             }else if((this.end>interval.start && interval.start>this.start) && interval.end< this.end){
                 return [new Interval(this.start,intersection.start),new Interval(intersection.end,this.end)]
-            }else if ((interval.end> this.start && this.start> interval.start) && this.end < interval.end){
+            }else if ((interval.end <= this.start && this.start> interval.start) && this.end < interval.end){
                 return [new Interval(interval.start,intersection.start),new Interval(intersection.end,interval.end)];
             }

[Killed] Block
testsProf/Tp_Node/src/interval.js:157:14
             }else if ((interval.end> this.start && this.start> interval.start) && this.end < interval.end){
                 return [new Interval(interval.start,intersection.start),new Interval(intersection.end,interval.end)];
             }
-        }else{
-            if(this.start < interval.start){
-                return [this,interval];
-            }else{
-                return [interval,this];
-            }
-        }
+        }else{}
     };
 }

[Killed] IfStatement
testsProf/Tp_Node/src/interval.js:158:16
                 return [new Interval(interval.start,intersection.start),new Interval(intersection.end,interval.end)];
             }
         }else{
-            if(this.start < interval.start){
+            if(false){
                 return [this,interval];
             }else{

[Killed] BinaryExpression
testsProf/Tp_Node/src/interval.js:158:16
                 return [new Interval(interval.start,intersection.start),new Interval(intersection.end,interval.end)];
             }
         }else{
-            if(this.start < interval.start){
+            if(this.start >= interval.start){
                 return [this,interval];
             }else{

[Killed] Block
testsProf/Tp_Node/src/interval.js:160:18
         }else{
             if(this.start < interval.start){
                 return [this,interval];
-            }else{
-                return [interval,this];
-            }
+            }else{}
         }
     };

[Killed] ArrayLiteral
testsProf/Tp_Node/src/interval.js:161:24
             if(this.start < interval.start){
                 return [this,interval];
             }else{
-                return [interval,this];
+                return [];
             }
         }
