[Killed] IfStatement
testsProf/Tp_Node/src/math.js:3:9
 let Util = {};
 Util.factorial = (n) => {
-    if (n === 0) {
+    if (true) {
         return 1;
     }

[Survived] StringLiteral
testsProf/Tp_Node/src/math.js:8:15
     }
 
     if (n >= 3000) {
-        throw 'n too large'
+        throw ""
     }
 

[Killed] IfStatement
testsProf/Tp_Node/src/math.js:11:9
         throw 'n too large'
     }
 
-    if (n < 0) {
+    if (true) {
         throw 'n is negative'
     }

[Killed] ConditionalExpression
testsProf/Tp_Node/src/math.js:27:20
  * @returns {boolean}
  */
 Util.isPrime = function (n) {
-    if (n === 1 || n === 0) {
+    if (n === 1 || true) {
         return false;
     }

[Killed] IfStatement
testsProf/Tp_Node/src/math.js:30:9
     if (n === 1 || n === 0) {
         return false;
     }
-    if (n < 0) {
+    if (true) {
         throw 'Unable to compute prime for n < 0'
     }

[Killed] BinaryExpression
testsProf/Tp_Node/src/math.js:33:21
     if (n < 0) {
         throw 'Unable to compute prime for n < 0'
     }
-    for (var i = 2; i < n; i++)
+    for (var i = 2; i <= n; i++)
         if (n % i === 0) return false;
     return true;

[Killed] Block
testsProf/Tp_Node/src/math.js:49:29
  * @param {number} n
  * @returns {number}
  */
-Util.sumPrime = function(n) {
-    if(n == 2){
-        return 2;
-    }
-    if(n < 2){
-        throw 'Unable to compute prime for n < 2';
-    }
-    if(Util.isPrime(n)){
-        return n + Util.sumPrime(n-1);
-    }
-    else{
-        return Util.sumPrime(n-1);
-    }
-
-};
+Util.sumPrime = function(n) {};
 
 /**

[Killed] Block
testsProf/Tp_Node/src/math.js:50:15
  * @returns {number}
  */
 Util.sumPrime = function(n) {
-    if(n == 2){
-        return 2;
-    }
+    if(n == 2){}
     if(n < 2){
         throw 'Unable to compute prime for n < 2';

[Killed] BinaryExpression
testsProf/Tp_Node/src/math.js:50:8
  * @returns {number}
  */
 Util.sumPrime = function(n) {
-    if(n == 2){
+    if(n != 2){
         return 2;
     }

[Killed] IfStatement
testsProf/Tp_Node/src/math.js:53:8
     if(n == 2){
         return 2;
     }
-    if(n < 2){
+    if(true){
         throw 'Unable to compute prime for n < 2';
     }

[Killed] BinaryExpression
testsProf/Tp_Node/src/math.js:53:8
     if(n == 2){
         return 2;
     }
-    if(n < 2){
+    if(n >= 2){
         throw 'Unable to compute prime for n < 2';
     }

[Survived] StringLiteral
testsProf/Tp_Node/src/math.js:54:15
         return 2;
     }
     if(n < 2){
-        throw 'Unable to compute prime for n < 2';
+        throw "";
     }
     if(Util.isPrime(n)){

[Killed] Block
testsProf/Tp_Node/src/math.js:56:24
     if(n < 2){
         throw 'Unable to compute prime for n < 2';
     }
-    if(Util.isPrime(n)){
-        return n + Util.sumPrime(n-1);
-    }
+    if(Util.isPrime(n)){}
     else{
         return Util.sumPrime(n-1);

[Killed] IfStatement
testsProf/Tp_Node/src/math.js:56:8
     if(n < 2){
         throw 'Unable to compute prime for n < 2';
     }
-    if(Util.isPrime(n)){
+    if(true){
         return n + Util.sumPrime(n-1);
     }

[Killed] BinaryExpression
testsProf/Tp_Node/src/math.js:57:16
         throw 'Unable to compute prime for n < 2';
     }
     if(Util.isPrime(n)){
-        return n + Util.sumPrime(n-1);
+        return n - Util.sumPrime(n - 1);
     }
     else{

[Killed] BinaryExpression
testsProf/Tp_Node/src/math.js:57:34
         throw 'Unable to compute prime for n < 2';
     }
     if(Util.isPrime(n)){
-        return n + Util.sumPrime(n-1);
+        return n + Util.sumPrime(n + 1);
     }
     else{

[Killed] Block
testsProf/Tp_Node/src/math.js:59:9
     if(Util.isPrime(n)){
         return n + Util.sumPrime(n-1);
     }
-    else{
-        return Util.sumPrime(n-1);
-    }
+    else{}
 
 };

[Killed] BinaryExpression
testsProf/Tp_Node/src/math.js:60:30
         return n + Util.sumPrime(n-1);
     }
     else{
-        return Util.sumPrime(n-1);
+        return Util.sumPrime(n + 1);
     }
 

[Killed] Block
testsProf/Tp_Node/src/math.js:77:29
  * @param {number} n
  * @returns {array}
  */
-Util.fizzBuzz = function(n) {
-    var tableau = [];
-    for(let i = 1; i <= n ; i++){
-        if( i% 3 == 0 && i%5 == 0){
-            tableau.push("FizzBuzz");
-        }
-        else if(i%3==0){
-            tableau.push("Fizz");
-        }
-        else if(i%5==0){
-            tableau.push("Buzz");
-        }
-        else{
-            tableau.push(i);
-        }
-    }
-    return tableau;
-};
+Util.fizzBuzz = function(n) {};
 
 /**

[Killed] Block
testsProf/Tp_Node/src/math.js:79:33
  */
 Util.fizzBuzz = function(n) {
     var tableau = [];
-    for(let i = 1; i <= n ; i++){
-        if( i% 3 == 0 && i%5 == 0){
-            tableau.push("FizzBuzz");
-        }
-        else if(i%3==0){
-            tableau.push("Fizz");
-        }
-        else if(i%5==0){
-            tableau.push("Buzz");
-        }
-        else{
-            tableau.push(i);
-        }
-    }
+    for(let i = 1; i <= n ; i++){}
     return tableau;
 };

[Killed] ForStatement
testsProf/Tp_Node/src/math.js:79:20
  */
 Util.fizzBuzz = function(n) {
     var tableau = [];
-    for(let i = 1; i <= n ; i++){
+    for(let i = 1; false ; i++){
         if( i% 3 == 0 && i%5 == 0){
             tableau.push("FizzBuzz");

[Killed] BinaryExpression
testsProf/Tp_Node/src/math.js:80:13
 Util.fizzBuzz = function(n) {
     var tableau = [];
     for(let i = 1; i <= n ; i++){
-        if( i% 3 == 0 && i%5 == 0){
+        if( i % 3 != 0 && i%5 == 0){
             tableau.push("FizzBuzz");
         }

[Killed] IfStatement
testsProf/Tp_Node/src/math.js:80:13
 Util.fizzBuzz = function(n) {
     var tableau = [];
     for(let i = 1; i <= n ; i++){
-        if( i% 3 == 0 && i%5 == 0){
+        if( true){
             tableau.push("FizzBuzz");
         }

[Killed] StringLiteral
testsProf/Tp_Node/src/math.js:81:26
     var tableau = [];
     for(let i = 1; i <= n ; i++){
         if( i% 3 == 0 && i%5 == 0){
-            tableau.push("FizzBuzz");
+            tableau.push("");
         }
         else if(i%3==0){

[Killed] IfStatement
testsProf/Tp_Node/src/math.js:83:17
         if( i% 3 == 0 && i%5 == 0){
             tableau.push("FizzBuzz");
         }
-        else if(i%3==0){
+        else if(true){
             tableau.push("Fizz");
         }

[Killed] BinaryExpression
testsProf/Tp_Node/src/math.js:83:17
         if( i% 3 == 0 && i%5 == 0){
             tableau.push("FizzBuzz");
         }
-        else if(i%3==0){
+        else if(i % 3 != 0){
             tableau.push("Fizz");
         }

[Killed] Block
testsProf/Tp_Node/src/math.js:86:24
         else if(i%3==0){
             tableau.push("Fizz");
         }
-        else if(i%5==0){
-            tableau.push("Buzz");
-        }
+        else if(i%5==0){}
         else{
             tableau.push(i);

[Killed] IfStatement
testsProf/Tp_Node/src/math.js:86:17
         else if(i%3==0){
             tableau.push("Fizz");
         }
-        else if(i%5==0){
+        else if(false){
             tableau.push("Buzz");
         }

[Killed] StringLiteral
testsProf/Tp_Node/src/math.js:87:26
             tableau.push("Fizz");
         }
         else if(i%5==0){
-            tableau.push("Buzz");
+            tableau.push("");
         }
         else{

[Killed] Block
testsProf/Tp_Node/src/math.js:89:13
         else if(i%5==0){
             tableau.push("Buzz");
         }
-        else{
-            tableau.push(i);
-        }
+        else{}
     }
     return tableau;

[Killed] Block
testsProf/Tp_Node/src/math.js:105:33
  * @param phrase
  * @returns {string}
  */
-Util.cipher = function (phrase) {
-
-    let phrase2 = "";
-
-    for (let i=0; i<phrase.length; ++i)
-    {
-        if (phrase[i] != " ")
-        {
-            phrase2 += String.fromCharCode(phrase[i].charCodeAt(0)+1);
-        }
-        else
-        {
-            phrase2 += " ";
-        }
-    }
-
-    return (phrase2)
-};
+Util.cipher = function (phrase) {};
 
 

[Killed] BinaryExpression
testsProf/Tp_Node/src/math.js:109:19
 
     let phrase2 = "";
 
-    for (let i=0; i<phrase.length; ++i)
+    for (let i=0; i <= phrase.length; ++i)
     {
         if (phrase[i] != " ")

[Killed] ForStatement
testsProf/Tp_Node/src/math.js:109:19
 
     let phrase2 = "";
 
-    for (let i=0; i<phrase.length; ++i)
+    for (let i=0; false; ++i)
     {
         if (phrase[i] != " ")

[Killed] Block
testsProf/Tp_Node/src/math.js:110:5
     let phrase2 = "";
 
     for (let i=0; i<phrase.length; ++i)
-    {
-        if (phrase[i] != " ")
-        {
-            phrase2 += String.fromCharCode(phrase[i].charCodeAt(0)+1);
-        }
-        else
-        {
-            phrase2 += " ";
-        }
-    }
+    {}
 
     return (phrase2)

[Killed] IfStatement
testsProf/Tp_Node/src/math.js:111:13
 
     for (let i=0; i<phrase.length; ++i)
     {
-        if (phrase[i] != " ")
+        if (true)
         {
             phrase2 += String.fromCharCode(phrase[i].charCodeAt(0)+1);

[Killed] BinaryExpression
testsProf/Tp_Node/src/math.js:111:13
 
     for (let i=0; i<phrase.length; ++i)
     {
-        if (phrase[i] != " ")
+        if (phrase[i] == " ")
         {
             phrase2 += String.fromCharCode(phrase[i].charCodeAt(0)+1);

[Killed] Block
testsProf/Tp_Node/src/math.js:112:9
     for (let i=0; i<phrase.length; ++i)
     {
         if (phrase[i] != " ")
-        {
-            phrase2 += String.fromCharCode(phrase[i].charCodeAt(0)+1);
-        }
+        {}
         else
         {

[Killed] BinaryExpression
testsProf/Tp_Node/src/math.js:113:44
     {
         if (phrase[i] != " ")
         {
-            phrase2 += String.fromCharCode(phrase[i].charCodeAt(0)+1);
+            phrase2 += String.fromCharCode(phrase[i].charCodeAt(0) - 1);
         }
         else

[Killed] Block
testsProf/Tp_Node/src/math.js:116:9
             phrase2 += String.fromCharCode(phrase[i].charCodeAt(0)+1);
         }
         else
-        {
-            phrase2 += " ";
-        }
+        {}
     }
 

[Survived] Block
testsProf/Tp_Node/src/math.js:137:30
  * @param array
  * @return int
  */
-Util.pairs = function(array) {
-    let res=0;
-    for(let i=0; i<array.length;i++){
-        let variable=array[i];
-        for(let j=i+1; j<array.length;j++){
-            if(variable==array[j]){
-                res++;
-            }
-        }
-    }
-    return res;
-};
+Util.pairs = function(array) {};
 
 Util.pairs2 = function(array) {

[Survived] ForStatement
testsProf/Tp_Node/src/math.js:139:18
  */
 Util.pairs = function(array) {
     let res=0;
-    for(let i=0; i<array.length;i++){
+    for(let i=0; false;i++){
         let variable=array[i];
         for(let j=i+1; j<array.length;j++){

[Survived] BinaryExpression
testsProf/Tp_Node/src/math.js:139:18
  */
 Util.pairs = function(array) {
     let res=0;
-    for(let i=0; i<array.length;i++){
+    for(let i=0; i <= array.length;i++){
         let variable=array[i];
         for(let j=i+1; j<array.length;j++){

[Survived] BinaryExpression
testsProf/Tp_Node/src/math.js:141:24
     let res=0;
     for(let i=0; i<array.length;i++){
         let variable=array[i];
-        for(let j=i+1; j<array.length;j++){
+        for(let j=i+1; j >= array.length;j++){
             if(variable==array[j]){
                 res++;

[Survived] ForStatement
testsProf/Tp_Node/src/math.js:141:24
     let res=0;
     for(let i=0; i<array.length;i++){
         let variable=array[i];
-        for(let j=i+1; j<array.length;j++){
+        for(let j=i+1; false;j++){
             if(variable==array[j]){
                 res++;

[Survived] IfStatement
testsProf/Tp_Node/src/math.js:142:16
     for(let i=0; i<array.length;i++){
         let variable=array[i];
         for(let j=i+1; j<array.length;j++){
-            if(variable==array[j]){
+            if(false){
                 res++;
             }

[Survived] IfStatement
testsProf/Tp_Node/src/math.js:142:16
     for(let i=0; i<array.length;i++){
         let variable=array[i];
         for(let j=i+1; j<array.length;j++){
-            if(variable==array[j]){
+            if(true){
                 res++;
             }

[Survived] PostfixUnaryExpression
testsProf/Tp_Node/src/math.js:143:17
         let variable=array[i];
         for(let j=i+1; j<array.length;j++){
             if(variable==array[j]){
-                res++;
+                res--;
             }
         }

[Survived] Block
testsProf/Tp_Node/src/math.js:150:31
     return res;
 };
 
-Util.pairs2 = function(array) {
-    let count = 0;
-    let temp = 1;
-
-    array.sort();
-    for ( var i = 1; i < array.length; i++ ) {
-        if ( array[i] === array[i-1] )
-            temp++;
-        else {
-            count += temp*(temp-1)/2
-            temp = 1;
-        }
-        
-    }
-    if(temp > 1 ){
-        count += temp*(temp-1)/2
-    }
-
-    return count;
-};
+Util.pairs2 = function(array) {};
 
 module.exports = Util;

[Survived] Block
testsProf/Tp_Node/src/math.js:155:46
     let temp = 1;
 
     array.sort();
-    for ( var i = 1; i < array.length; i++ ) {
-        if ( array[i] === array[i-1] )
-            temp++;
-        else {
-            count += temp*(temp-1)/2
-            temp = 1;
-        }
-        
-    }
+    for ( var i = 1; i < array.length; i++ ) {}
     if(temp > 1 ){
         count += temp*(temp-1)/2

[Survived] ForStatement
testsProf/Tp_Node/src/math.js:155:22
     let temp = 1;
 
     array.sort();
-    for ( var i = 1; i < array.length; i++ ) {
+    for ( var i = 1; false; i++ ) {
         if ( array[i] === array[i-1] )
             temp++;

[Survived] BinaryExpression
testsProf/Tp_Node/src/math.js:156:14
 
     array.sort();
     for ( var i = 1; i < array.length; i++ ) {
-        if ( array[i] === array[i-1] )
+        if ( array[i] !== array[i - 1] )
             temp++;
         else {

[Survived] BinaryExpression
testsProf/Tp_Node/src/math.js:156:33
 
     array.sort();
     for ( var i = 1; i < array.length; i++ ) {
-        if ( array[i] === array[i-1] )
+        if ( array[i] === array[i + 1] )
             temp++;
         else {

[Survived] PostfixUnaryExpression
testsProf/Tp_Node/src/math.js:157:13
     array.sort();
     for ( var i = 1; i < array.length; i++ ) {
         if ( array[i] === array[i-1] )
-            temp++;
+            temp--;
         else {
             count += temp*(temp-1)/2

[Survived] Block
testsProf/Tp_Node/src/math.js:158:14
     for ( var i = 1; i < array.length; i++ ) {
         if ( array[i] === array[i-1] )
             temp++;
-        else {
-            count += temp*(temp-1)/2
-            temp = 1;
-        }
+        else {}
         
     }

[Survived] BinaryExpression
testsProf/Tp_Node/src/math.js:159:22
         if ( array[i] === array[i-1] )
             temp++;
         else {
-            count += temp*(temp-1)/2
+            count += temp * (temp - 1) * 2
             temp = 1;
         }

[Survived] BinaryExpression
testsProf/Tp_Node/src/math.js:159:22
         if ( array[i] === array[i-1] )
             temp++;
         else {
-            count += temp*(temp-1)/2
+            count += temp / (temp - 1)/2
             temp = 1;
         }

[Survived] IfStatement
testsProf/Tp_Node/src/math.js:164:8
         }
         
     }
-    if(temp > 1 ){
+    if(false ){
         count += temp*(temp-1)/2
     }

[Survived] Block
testsProf/Tp_Node/src/math.js:164:18
         }
         
     }
-    if(temp > 1 ){
-        count += temp*(temp-1)/2
-    }
+    if(temp > 1 ){}
 
     return count;

[Survived] BinaryExpression
testsProf/Tp_Node/src/math.js:165:18
         
     }
     if(temp > 1 ){
-        count += temp*(temp-1)/2
+        count += temp * (temp - 1) * 2
     }
 

[Survived] BinaryExpression
testsProf/Tp_Node/src/math.js:165:24
         
     }
     if(temp > 1 ){
-        count += temp*(temp-1)/2
+        count += temp*(temp + 1)/2
     }
 
