[Survived] ObjectLiteral
testsProf/Tp_Node/src/test-script.js:7:17
 const repository = new BookRepository(db);
 
 
-repository.save({
-    'id' : 1,
-    "name" :"test",
-    'price' :6.1,
-    "added_at" : '2019-01-01'
-});
+repository.save({});

[Survived] StringLiteral
testsProf/Tp_Node/src/test-script.js:11:5
     'id' : 1,
     "name" :"test",
     'price' :6.1,
-    "added_at" : '2019-01-01'
+    "" : '2019-01-01'
 });

[Survived] StringLiteral
testsProf/Tp_Node/src/test-script.js:11:18
     'id' : 1,
     "name" :"test",
     'price' :6.1,
-    "added_at" : '2019-01-01'
+    "added_at" : ""
 });
